1. Import the necessary libraries

In [55]:
import pandas as pd

2. Import the dataset US_Baby_Names_right.csv

3. Assign it to a variable called baby_names

In [59]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

In [61]:
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

4. See the first 10 entries

In [65]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

5. Delete the column 'Unnamed: 0' and 'Id'

In [68]:
baby_names.drop(columns=["Unnamed: 0","Id"],inplace=True)
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

6. Are there more male or female names in the dataset?

In [71]:
gender_counts = baby_names['Gender'].value_counts()
print(gender_counts)

Gender
F    558846
M    457549
Name: count, dtype: int64

7. Group the dataset by name and assign to names

In [97]:
baby_names[["Name","Count"]].groupby("Name").sum().reset_index().head(5)

      Name  Count
0    Aaban     12
1    Aadan     23
2  Aadarsh      5
3    Aaden   3426
4   Aadhav      6

8. How many different names exist in the dataset?

In [103]:
unique_names_count = names.shape[0]
print(unique_names_count)
baby_names[["Name","Count"]].groupby("Name").sum().sort_values("Count",ascending = 0).head(5)

17632

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

9. What is the name with most occurrences?

In [83]:
most_common_name = names['Count'].idxmax()
print(most_common_name)

Jacob

10. How many different names have the least occurrences?

In [113]:
least_occurrences = names['Count'].min()
least_occurrences_count = (names['Count'] == least_occurrences).sum()
print(least_occurrences_count)

name_counts = baby_names.groupby('Name').size().reset_index(name='Count')
min_count = name_counts['Count'].min()
name_counts[name_counts['Count'] == min_count]

2578

             Name  Count
2         Aadarsh      1
4          Aadhav      1
7           Aadin      1
15          Aahna      1
17          Aaima      1
...           ...    ...
17605    Zykeriah      1
17608    Zykierra      1
17616      Zymari      1
17626  Zyquavious      1
17629       Zyren      1

[3682 rows x 2 columns]

11. What is the median name occurrence?

In [107]:
median_occurrence = names['Count'].median()
print(median_occurrence)

49.0

12. Get a summary with the mean, min, max, std and quartiles.

In [93]:
summary = names['Count'].describe()
print(summary)

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64